In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.DataFrame()
df['id'] = list(range(1,6))
df['name'] = [chr(i) for i in range(ord('A'), ord('F'))]
df['mark'] = np.random.randint(low = 50, high = 99, size = 5)
df

   id name  mark
0   1    A    69
1   2    B    52
2   3    C    57
3   4    D    93
4   5    E    97

### Concatenate a pandas series to a pandas dataframe rowwise (`axis = 0`) [similar to rbind in R]

When concatenating row wise care must be taken that the series which is to be concatenated (rbind) must have the same data type and it must be converted to a dataframe then transposed and with same column names.

In [3]:
temp = pd.DataFrame(pd.Series([6, 'F', 78])).T
temp.columns = ['id', 'name', 'mark']
temp

  id name mark
0  6    F   78

In [4]:
pd.concat([df, temp], ignore_index=True) # axis = 0 is used by default

  id name mark
0  1    A   69
1  2    B   52
2  3    C   57
3  4    D   93
4  5    E   97
5  6    F   78